# -------------------------------------------------
print('-------------------------------------------')

print("""w

w
w
""", end='')

str1 = """zzz"""
str2 = """aa
ss"""

print(str1 + str2, end = '\n')

# 用三个引号配对使用来表示长字符串

# -------------------------------------------------
print('-------------------------------------------')

# 通过显式行连接（Explicit Line Joining）输出多物理行为一行
print("This is the first sentence. \
This is the second sentence.")

# -------------------------------------------------
print('-------------------------------------------')
